In [1]:
import pandas as pd
import numpy as np

# 예제 데이터프레임 생성
data = {
    "Age": [23, 45, 31, 27, np.nan, 36, 50],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female", "Male"],
    "Salary": [3000, 4500, 3200, 5000, np.nan, 5600, 7500],
    "Department": [
        "Sales",
        "Engineering",
        "HR",
        "Marketing",
        "Sales",
        "HR",
        "Engineering",
    ],
    "City": [
        "New York",
        "Los Angeles",
        "New York",
        "Chicago",
        np.nan,
        "Chicago",
        "Los Angeles",
    ],
    "Join_Date": [
        "2015-01-01",
        "2016-03-15",
        "2018-06-25",
        "2017-08-09",
        "2015-12-19",
        "2019-11-30",
        "2018-02-05",
    ],
}
df = pd.DataFrame(data)

문제 1: 데이터 로드 및 기본 탐색  
data.csv 파일을 불러와 df라는 이름의 데이터프레임으로 저장하세요.  
데이터의 행과 열 수를 출력하세요.  
모든 열의 데이터 타입과 결측값 개수를 출력하세요.

In [3]:
print(df.shape)

(7, 6)

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Age         6 non-null      float64
 1   Gender      7 non-null      object
 2   Salary      6 non-null      float64
 3   Department  7 non-null      object
 4   City        6 non-null      object
 5   Join_Date   7 non-null      object
dtypes: float64(2), object(4)
memory usage: 468.0+ bytes
None

문제 2: 데이터 필터링 및 선택  
Age 열의 값이 30 이상인 데이터만 선택하여 df_age로 저장하세요.  
Gender 열의 값이 'Male'인 데이터만 선택하여 df_male로 저장하세요.  
Salary 열의 값이 가장 높은 데이터와 가장 낮은 데이터를 각각 출력하세요.

In [7]:
df_age = df[df["Age"] >= 30]
print(df_age)

    Age  Gender  Salary   Department         City   Join_Date
1  45.0  Female  4500.0  Engineering  Los Angeles  2016-03-15
2  31.0    Male  3200.0           HR     New York  2018-06-25
5  36.0  Female  5600.0           HR      Chicago  2019-11-30
6  50.0    Male  7500.0  Engineering  Los Angeles  2018-02-05

In [8]:
df_male = df[df["Gender"] == "Male"]
print(df_male)

    Age Gender  Salary   Department         City   Join_Date
0  23.0   Male  3000.0        Sales     New York  2015-01-01
2  31.0   Male  3200.0           HR     New York  2018-06-25
4   NaN   Male     NaN        Sales          NaN  2015-12-19
6  50.0   Male  7500.0  Engineering  Los Angeles  2018-02-05

In [10]:
high = df[df["Salary"] == df["Salary"].max()]
low = df[df["Salary"] == df["Salary"].min()]
print(high, "\n", low)

    Age Gender  Salary   Department         City   Join_Date
6  50.0   Male  7500.0  Engineering  Los Angeles  2018-02-05
     Age Gender  Salary Department      City   Join_Date
0  23.0   Male  3000.0      Sales  New York  2015-01-01

문제 3: 결측값 처리  
결측값이 있는 모든 행을 삭제한 후, 데이터의 행 수를 출력하세요.  
Age, Salary 열의 결측값을 각각의 열 평균값으로 대체하세요.  
City 열에 결측값이 있으면 **'Unknown'**으로 채우세요.

In [11]:
df.isnull().sum()

Age           1
Gender        0
Salary        1
Department    0
City          1
Join_Date     0
dtype: int64

In [16]:
print(df.shape)
df_drop = df.dropna()
print(df_drop.shape)

(7, 6)
(6, 6)

In [18]:
df["Age"] = df["Age"].fillna(df["Age"].mean())
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())
df["City"] = df["City"].fillna("Unknown")
print(df)
df.isnull().sum()

         Age  Gender  Salary   Department         City   Join_Date
0  23.000000    Male  3000.0        Sales     New York  2015-01-01
1  45.000000  Female  4500.0  Engineering  Los Angeles  2016-03-15
2  31.000000    Male  3200.0           HR     New York  2018-06-25
3  27.000000  Female  5000.0    Marketing      Chicago  2017-08-09
4  35.333333    Male  4800.0        Sales      Unknown  2015-12-19
5  36.000000  Female  5600.0           HR      Chicago  2019-11-30
6  50.000000    Male  7500.0  Engineering  Los Angeles  2018-02-05

Age           0
Gender        0
Salary        0
Department    0
City          0
Join_Date     0
dtype: int64

문제 4: 데이터 그룹화와 집계  
Department 열을 기준으로 Salary 열의 평균을 구하세요.  
Gender와 Department로 그룹화하여 Salary의 합계를 구하세요.  
Age 열을 기준으로 **연령대(10대, 20대, 30대 등)**별로 평균 Salary를 계산하세요.

In [21]:
df.groupby('Department')['Salary'].mean()

Department
Engineering    6000.0
HR             4400.0
Marketing      5000.0
Sales          3900.0
Name: Salary, dtype: float64

In [22]:
df.groupby(['Gender', 'Department'])['Salary'].sum()

Gender  Department
Female  Engineering    4500.0
        HR             5600.0
        Marketing      5000.0
Male    Engineering    7500.0
        HR             3200.0
        Sales          7800.0
Name: Salary, dtype: float64

In [29]:
df["Age_Group"] = pd.cut(df['Age'], bins=[0, 20, 30, 40, 50, 60], labels=["10", "20", "30", "40", "50"])
df.groupby(["Age_Group"])["Salary"].mean()

C:\Users\nsh\AppData\Local\Temp\ipykernel_16516\3280687768.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["Age_Group"])["Salary"].mean()

Age_Group
10            NaN
20    4000.000000
30    4533.333333
40    6000.000000
50            NaN
Name: Salary, dtype: float64

문제 5: 데이터 변형 및 생성  
Salary가 5000 이상이면 'High', 5000 미만이면 'Low'로 구분하는 Salary_Level이라는 새로운 열을 추가하세요.  
Join_Date 열의 연도(Year)와 월(Month)만 추출하여 각각 Join_Year, Join_Month라는 열을 추가하세요.  
Last_Login 열의 날짜 데이터를 연도-월-일 형식으로 변경하세요.

In [30]:
df["Salary_Level"] = df["Salary"].apply(lambda x : "High" if x >= 5000 else "Low")
print(df[["Salary_Level", "Salary"]])

  Salary_Level  Salary
0          Low  3000.0
1          Low  4500.0
2          Low  3200.0
3         High  5000.0
4          Low  4800.0
5         High  5600.0
6         High  7500.0

In [38]:
# year, momth, day = df["Join_Date"].split("-")
# print(year, momth, day)
df["Join_Year"] = pd.to_datetime(df["Join_Date"]).dt.year
df["Join_Month"] = pd.to_datetime(df["Join_Date"]).dt.month
df["Join_Month"]
# df["Join_Date"].values.astype(str).tolist()

0     1
1     3
2     6
3     8
4    12
5    11
6     2
Name: Join_Month, dtype: int32

In [40]:
df["Join_Date"] = pd.to_datetime(df["Join_Date"]).dt.strftime("%Y-%M-%d")
df["Join_Date"]

0    2015-00-01
1    2016-00-15
2    2018-00-25
3    2017-00-09
4    2015-00-19
5    2019-00-30
6    2018-00-05
Name: Join_Date, dtype: object

문제 6: 데이터 인코딩 및 정렬  
One-Hot Encoding을 사용하여 Department 열을 인코딩하고, 인코딩된 데이터프레임을 출력하세요.  
Salary 열을 기준으로 데이터를 내림차순 정렬하고, Age 열을 기준으로 오름차순으로 다시 정렬하세요.  
Gender 열을 Label Encoding하여 'Male'은 1, 'Female'은 0으로 변환하세요.

In [43]:
df_onehot = pd.get_dummies(df, columns=["Department"])
df_onehot

,Age,Gender,Salary,City,Join_Date,Age_Group,Salary_Level,Join_Year,Join_Month,Department_Engineering,Department_HR,Department_Marketing,Department_Sales
0,23.000000,Male,3000.0,New York,2015-00-01,20,Low,2015,1,False,False,False,True
1,45.000000,Female,4500.0,Los Angeles,2016-00-15,40,Low,2016,3,True,False,False,False
2,31.000000,Male,3200.0,New York,2018-00-25,30,Low,2018,6,False,True,False,False
3,27.000000,Female,5000.0,Chicago,2017-00-09,20,High,2017,8,False,False,True,False
4,35.333333,Male,4800.0,Unknown,2015-00-19,30,Low,2015,12,False,False,False,True
5,36.000000,Female,5600.0,Chicago,2019-00-30,30,High,2019,11,False,True,False,False
6,50.000000,Male,7500.0,Los Angeles,2018-00-05,40,High,2018,2,True,False,False,False

In [45]:
df_sorted = df.sort_values(by=["Salary", "Age"], ascending=[False, True])
df_sorted

,Age,Gender,Salary,Department,City,Join_Date,Age_Group,Salary_Level,Join_Year,Join_Month
6,50.000000,Male,7500.0,Engineering,Los Angeles,2018-00-05,40,High,2018,2
5,36.000000,Female,5600.0,HR,Chicago,2019-00-30,30,High,2019,11
3,27.000000,Female,5000.0,Marketing,Chicago,2017-00-09,20,High,2017,8
4,35.333333,Male,4800.0,Sales,Unknown,2015-00-19,30,Low,2015,12
1,45.000000,Female,4500.0,Engineering,Los Angeles,2016-00-15,40,Low,2016,3
2,31.000000,Male,3200.0,HR,New York,2018-00-25,30,Low,2018,6
0,23.000000,Male,3000.0,Sales,New York,2015-00-01,20,Low,2015,1

In [46]:
df['Gender_encoded'] = df['Gender'].map({"Male" : 1, "Female" : 0})
df['Gender_encoded']

0    1
1    0
2    1
3    0
4    1
5    0
6    1
Name: Gender_encoded, dtype: int64

문제 7: 고급 필터링 및 조건문  
Age가 30 이상이고 City가 'New York'인 데이터만 추출하세요.  
Salary_Level이 'High'인 사람들의 평균 연봉을 구하세요.  
Age가 25 이상이면서 Salary가 7000 이상인 경우, High_Earner라는 새로운 열에 True를 넣고, 그렇지 않으면 False를 넣어보세요.

In [47]:
filter = df[(df["Age"] >= 30) & (df["City"] == "New York")]
filter

,Age,Gender,Salary,Department,City,Join_Date,Age_Group,Salary_Level,Join_Year,Join_Month,Gender_encoded
2,31.0,Male,3200.0,HR,New York,2018-00-25,30,Low,2018,6,1

In [49]:
mean_salary = df[df["Salary_Level"] == "High"]["Salary"].mean()
mean_salary

6033.333333333333

In [ ]:
df["High_Earner"] = (df["Age"] >= 25) & (df["Salary"] >= 7000)
df["High_Earner"]

문제 10: 데이터 결합 및 병합  
- 새로운 데이터프레임 department_info를 생성하고, Department 열과 해당 부서의 위치(Location) 정보를 포함하세요.  
- df와 department_info를 Department 열을 기준으로 병합하세요.  
- df에서 중복된 데이터를 제거한 후, 결과를 출력하세요.

In [55]:
department_info = pd.DataFrame({
    'Department': ['Sales', 'Engineering', 'HR', 'Marketing'],
    'Location': ['Building A', 'Building B', 'Building C', 'Building D']
})

In [57]:
df_merged = pd.merge(df, department_info, on='Department', how='left')
df_merged

,Age,Gender,Salary,Department,City,Join_Date,Age_Group,Salary_Level,Join_Year,Join_Month,Gender_encoded,High_Earner,Location
0,23.000000,Male,3000.0,Sales,New York,2015-00-01,20,Low,2015,1,1,False,Building A
1,45.000000,Female,4500.0,Engineering,Los Angeles,2016-00-15,40,Low,2016,3,0,False,Building B
2,31.000000,Male,3200.0,HR,New York,2018-00-25,30,Low,2018,6,1,False,Building C
3,27.000000,Female,5000.0,Marketing,Chicago,2017-00-09,20,High,2017,8,0,False,Building D
4,35.333333,Male,4800.0,Sales,Unknown,2015-00-19,30,Low,2015,12,1,False,Building A
5,36.000000,Female,5600.0,HR,Chicago,2019-00-30,30,High,2019,11,0,False,Building C
6,50.000000,Male,7500.0,Engineering,Los Angeles,2018-00-05,40,High,2018,2,1,True,Building B

In [58]:
df_depued = df_merged.drop_duplicates()
df_depued

,Age,Gender,Salary,Department,City,Join_Date,Age_Group,Salary_Level,Join_Year,Join_Month,Gender_encoded,High_Earner,Location
0,23.000000,Male,3000.0,Sales,New York,2015-00-01,20,Low,2015,1,1,False,Building A
1,45.000000,Female,4500.0,Engineering,Los Angeles,2016-00-15,40,Low,2016,3,0,False,Building B
2,31.000000,Male,3200.0,HR,New York,2018-00-25,30,Low,2018,6,1,False,Building C
3,27.000000,Female,5000.0,Marketing,Chicago,2017-00-09,20,High,2017,8,0,False,Building D
4,35.333333,Male,4800.0,Sales,Unknown,2015-00-19,30,Low,2015,12,1,False,Building A
5,36.000000,Female,5600.0,HR,Chicago,2019-00-30,30,High,2019,11,0,False,Building C
6,50.000000,Male,7500.0,Engineering,Los Angeles,2018-00-05,40,High,2018,2,1,True,Building B